perf-tests/oha/results/load-test-create-tickets.txt
bash perf-tests/oha/load-test-create-tickets.sh
Created test user: loadtest_1763134043@example.com (password: LoadTestP@ssw0rd)
Cookie saved to /tmp/ticketing_test_cookie.txt
🎟 Ticket Service Load Test: POST
Summary:
  Success rate: 100.00%
  Total:        6.0401 10 sec
  Slowest:      5.9483 10 sec
  Fastest:      0.0110 10 sec
  Average:      0.4036 10 sec
  Requests/sec: 55.4629

  Total data:   337.88 KiB
  Size/request: 130 B
  Size/sec:     5.59 KiB

Response time histogram:
  0.011 10 sec [1]    |
  0.605 10 sec [2225] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.198 10 sec [200]  |■■
  1.792 10 sec [107]  |■
  2.386 10 sec [24]   |
  2.980 10 sec [15]   |
  3.573 10 sec [18]   |
  4.167 10 sec [15]   |
  4.761 10 sec [11]   |
  5.355 10 sec [14]   |
  5.948 10 sec [20]   |

Response time distribution:
  10.00% in 0.0603 10 sec
  25.00% in 0.0952 10 sec
  50.00% in 0.1412 10 sec
  75.00% in 0.1961 10 sec
  90.00% in 1.0791 10 sec
  95.00% in 1.6167 10 sec
  99.00% in 5.0864 10 sec
  99.90% in 5.8836 10 sec
  99.99% in 5.9483 10 sec


Details (average, fastest, slowest):
  DNS+dialup:   0.0131 10 sec, 0.0002 10 sec, 0.2437 10 sec
  DNS-lookup:   0.0000 10 sec, 0.0000 10 sec, 0.0021 10 sec

Status code distribution:
  [201] 2599 responses
  [504] 47 responses
  [502] 4 responses

Error distribution:
  [700] aborted due to deadline